# Напишите программу, которая получает три числа и выводит количество одинаковых чисел в этой цепочке.

a = int(input())
b = int(input())
c = int(input())
d = int(input())

if a == c or b == d:
    print('YES')
else:
    print('NO')
